atmosphere/tutorials/ce3/bubble_250m/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-125 -125 0)        //0
    (4875 -125 0)     //1
    (4875  9875 0)  //2
    (-125 9875 0)     //3
    (-125 -125 1000)        //4
    (4875 -125 1000)     //5
    (4875 9875 1000)  //6
    (-125 9875 1000)     //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
         type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 5 1)
        );
    }
    left
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
         type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (1 5 6 2)
        );
    }

    frontandback
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
